# Network Device Security Overview

### 使用網路設備時常見的威脅

+ 遠端存取威脅: 未授權的遠端存取

+ 本地端存取與實體威脅: 實體設備的損壞、密碼遺失的復原、設備遭受竊盜

+ 環境威脅: 極高或極低的溫度、高濕度

+ 電氣威脅: 電源電壓不足、電湧 (Voltage Spikes)

+ 維護威脅: 問題維護處理不當、線路佈線不良、線路與設備的標示不足

### 應用於上線或離線時獲取密碼的方法

+ 猜測

+ 暴力破解

+ 字典攻擊

### 密碼策略

+ 密碼複雜度: 使用較長的密碼、使用範圍較大的字符集

+ 密碼管理: 儲存、保護、密碼更改

### 替代密碼有

+ 多因素 (Multi-Factor) 認證，例如帳號密碼加驗證器

+ 數字憑證

+ 生物識別

# Securing Access to Privileged EXEC Mode

+ 設定啟用 Secret Password 與 Password

    ```
    Switch(config)# enable secret {password}
    Switch(config)# enable password {password}
    ```

    Secret Password 在 Running-Config 中會以密文儲存，Password 會以明文儲存

    `enable secret` 的優先權永遠大於 `enable password`，建議使用 `enable secret`

+ 加密明文 Password

    ```
    Switch(config)# service passowrd-encryption
    Switch(config)# exit
    ```

    可以將 Running-Config 中明文的 Password 加密

# Securing Console Access

+ 設定 Console 密碼

    ```
    Switch(config)# line console 0
    Switch(config-line)# password {password}
    Switch(config-line)# login
    Switch(config-line)# end
    ```

    `Switch(config-line)# login` 是啟用 Console 登入

+ 加密明文密碼

    同樣透過 `service passowrd-encryption` 加密明文密碼

+ 以 `username` 命命設定密碼，並在透過 Console 存取時要求使用者輸入

    ```
    Switch(config)# username {username} password {password}
    Switch(config)# line console 0
    Switch(config-line)# login local
    Switch(config-line)# end
    ```

    `Switch(config-line)# login local` 表示啟用 Console 登入，並使用本地端的帳號密碼進行驗證

    `username {username} password {password}` 也可以改為使用 `username {username} secret {password}`，以密文的方式儲存密碼

+ 設定 EXEC 的逾時時間

    ```
    Switch(config)# line console 0
    Switch(config-line)# exec-timeout {Minute} {Second}
    ```

    `exec-timeout 0 0` 表是永不逾時

# Securing Remote Access

+ 設定 Virtual Treminal 密碼

    ```
    Switch(config)# line vty 0 15
    Switch(config-line)# login
    Switch(config-line)# password {password}
    ```

    `Switch(config-line)# login` 表示啟用 Virtual Treminal (Telnet) 登入

+ 設定 EXEC 逾時

    ```
    Switch(config-line)# exec-timeout {Minute} {Second}
    ```

+ 設定 SSH

    ```
    Switch(config)# hostname SwitchX
    SwitchX(config)# ip domain-name {domain.name}
    SwitchX(config)# username {username} secret {password}
    SwitchX(config)# crypto key generate rsa modulus 2048
    SwitchX(config)# line vty 0 15
    SwitchX(config-line)# login local
    SwitchX(config-line)# transport input ssh
    SwitchX(config-line)# exit
    SwitchX(config)# ip ssh version 2
    ```

    `crypto key generate rsa modulus 2048` 可以產生 RAS 的金鑰對 (公鑰與私鑰)

    `transport input ssh` 用於定義該連入線路使用何種協定

    `ip ssh version 2` 指定 Switch 使用的 SSH 版本

+ 驗證 SSH 啟用

    `Switch# show ip ssh` 可以列出 SSH 狀態

+ 檢查設備目前透過 SSH 的連入

    `Switch# show ssh` 可以列出目前 SSH 的連線狀態

# Configuring the Loging Banner

+ 設定 Loging Banner

    `Switch(config)# banner login` 可以設定使用者連入設備後會看到的訊息

# Limiting Remote Access with ACLs

+ 例如利用 ACL 限制只有 10.1.1.0/24 的網路可以對路由器以 Telnet 進行存取

    ```
    Route(config)# access-list 1 permit 10.1.1.0 0.0.0.255
    Route(config)# access-list 1 deny any log
    Route(config)# line vty 0 15
    Route(config-line)# access-class 1 in
    ```

    `access-list 1 deny any log` 表示有符合這個 ACL 的封包，就在日誌記錄下來

    `access-class 1 in` 將 ACL 的設定套用到該 vty Line 上

# External Authentication Options 外部身分驗證

+ 使用本地的資料庫在網路設備上執行 AAA 驗證，會有擴展性不佳的問題

    Client 傳送驗證請求到網路設備，網路設備查詢 AAA Server (RADIUS/TACASC+) ，AAA Server 回應查詢結果，網路設備再回應 Client 是否可以登入設備

+ IEEE 802.1X 定義了基於身分驗證的連線

    使用者在連接網路時便進行身分驗證，無論他實際的位置在哪裡